---
kind: method
id: M:Autodesk.Revit.DB.Structure.FabricSheet.GetReinforcementRoundingManager
source: html/6dc752d4-a675-2f4f-03fd-42a58620dae3.htm
---
# Autodesk.Revit.DB.Structure.FabricSheet.GetReinforcementRoundingManager Method

Returns an object for managing reinforcement rounding override settings.

## Syntax (C#)
```csharp
public FabricRoundingManager GetReinforcementRoundingManager()
```

## Returns
The rounding manager.